MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC120RD3DN/mcu.h
 * |        |          |(1, 1, 0, 1) = AD11 function is selected.         
 * |[3]     |GPA_MFP3  |PA.3 Pin Function Selection   
 * |        |          |Bits EBI_HB_EN[2] (ALT_MFP[18]), EBI_EN (ALT_MFP[11]), PA3_SC0DAT (ALT_MFP1[1]) and GPA_MFP[3] determine the PA.3 function.
 * |        |          |(EBI_HB_EN[2], EBI_EN, PA3_SC0DAT, GPA_MFP3) value and function mapping is as following list.
 * |        |          |(0, 0, 0, 0) = GPIO function is selected.
 * |        |          |(0, 0, 0, 1) = ADC3 function is selected.
 * |        |          |(0, 0, 1, 1) = SC0_DAT function is selected.
 * |        |          |(1, 1, 0, 1) = AD10 function is selected.
 * |[4]     |GPA_MFP4  |PA.4 Pin Function Selection     
 * |        |          |Bits EBI_HB_EN[1] (ALT_MFP[17]), EBI_EN (ALT_MFP[11]), PA4_SC1PWR (ALT_MFP1[7]) and GPA_MFP[4] determine the PA.4 function.
 * |        |          |(EBI_HB_EN[1], EBI_EN, PA4_SC1PWR, GPA_MFP4) value and function mapping is as following list.
 * |        |          |(0, 0, 0, 0) = GPIO function is selected.
 * |        |          |(0, 0, 0, 1) = ADC4 function is selected.
 * |        |          |(0, 0, 1, 1) = SC1_PWR function is selected.
 * |        |          |(1, 1, 0, 1) = AD9 function is selected.     
 * |[5]     |GPA_MFP5  |PA.5 Pin Function Selection    
 * |        |          |Bits EBI_HB_EN[0] (ALT_MFP[16]), EBI_EN (ALT_MFP[11]), PA5_SC1RST (ALT_MFP1[8]) and GPA_MFP[5] determine the PA.5 function.
 * |        |          |(EBI_HB_EN[0], EBI_EN, PA5_SC1RST, GPA_MFP5) value and function mapping is as following list,
 * |        |          |(0, 0, 0, 0) = GPIO function is selected.
 * |        |          |(0, 0, 0, 1) = ADC5 function is selected.
 * |        |          |(0, 0, 1, 1) = SC1_RST function is selected.
 * |        |          |(1, 1, 0, 1) = AD8 function is selected.     
 * |[6]     |GPA_MFP6  |PA.6 Pin Function Selection
 * |        |          |Bits EBI_EN (ALT_MFP[11]), PA6_SC1CLK (ALT_MFP1[5]) and GPA_MFP[6] determine the PA.6 function.
 * |        |          |(EBI_EN, PA6_SC1CLK, GPA_MFP6) value and function mapping is as following list.
 * |        |          |(0, 0, 0) = GPIO function is selected.
 * |        |          |(0, 0, 1) = ADC6 function is selected.
 * |        |          |(0, 1, 1) = SC1_CLK function is selected.
 * |        |          |(1, 0, 1) = AD7 function is selected.     
 * |[7]     |GPA_MFP7  |PA.7 Pin Function Selection
 * |        |          |Bits EBI_EN (ALT_MFP[11]), PA7_SC1DAT (ALT_MFP1[6]), PA7_S21 (ALT_MFP[2]) and GPA_MFP[7] determine the PA.7 function.
 * |        |          |(EBI_EN, PA7_SC1DAT, PA7_S21, GPA_MFP7) value and function mapping is as following list.
 * |        |          |(0, 0, 0, 0) = GPIO function is selected.
 * |        |          |(0, 0, 0, 1) = ADC7 function is selected.
 * |        |          |(0, 0, 1, 1) = SPI2_SS1 function is selected.
 * |        |          |(0, 1, 0, 1) = SC1_DAT function is selected.
 * |        |          |(1, 0, 0, 1) = AD6 function is selected.     
 * |[8]     |GPA_MFP8  |PA.8 Pin Function Selection
 * |        |          |Bit GPA_MFP[8] determines the PA.8 function.
 * |        |          |0 = GPIO function is selected to the pin PA.8.
 * |        |          |1 = I2C0_SDA function is selected to the pin PA.8.
 * |[10]    |GPA_MFP9  |PA.9 Pin Function Selection
 * |        |          |Bit GPA_MFP[9] determines the PA.9 function.
 * |        |          |0 = GPIO function is selected to the pin PA.9.
 * |        |          |1 = I2C0_SCL function is selected to the pin PA.9.
 * |[10]    |GPA_MFP10 |PA.10 Pin Function Selection
 * |        |          |Bits EBI_EN (ALT_MFP[11]) and GPA_MFP[10] determine the PA.10 function.
 * |        |          |(EBI_EN, GPA_MFP10) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = I2C1_SDA function is selected.
 * |        |          |(1, 1) = nWR(EBI) function is selected.     
 * |[11]    |GPA_MFP11 |PA.11 Pin Function Selection
 * |        |          |Bits EBI_EN (ALT_MFP[11]) and GPA_MFP[11] determine the PA.11 function.
 * |        |          |(EBI_EN, GPA_MFP11) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = I2C1_SCL function is selected.
 * |        |          |(1, 1) = nRD(EBI) function is selected.     
 * |[12]    |GPA_MFP12 |PA.12 Pin Function Selection
 * |        |          |Bits EBI_HB_EN[5] (ALT_MFP[21]), EBI_EN (ALT_MFP[11]), PA12_SC2DAT (ALT_MFP1[11]) and GPA_MFP[12] determine the PA.12 function.
 * |        |          |(EBI_HB_EN[5], EBI_EN, PA12_SC2DAT, GPA_MFP12) value and function mapping is as following list.
 * |        |          |(0, 0, 0, 0) = GPIO function is selected.
 * |        |          |(0, 0, 0, 1) = PWM0 function is selected.
 * |        |          |(0, 0, 1, 1) = SC2_DAT function is selected.
 * |        |          |(1, 1, 0, 1) = AD13 function is selected.       
 * |[13]    |GPA_MFP13 |PA.13 Pin Function Selection     
 * |        |          |Bits EBI_HB_EN[6] (ALT_MFP[22]), EBI_EN (ALT_MFP[11]), PA13_SC2CLK (ALT_MFP1[10]) and GPA_MFP[13] determine the PA.13 function.
 * |        |          |(EBI_HB_EN[6], EBI_EN, PA13_SC2CLK, GPA_MFP13) value and function mapping is as following list.
 * |        |          |(0, 0, 0, 0) = GPIO function is selected.
 * |        |          |(0, 0, 0, 1) = PWM1 function is selected.
 * |        |          |(0, 0, 1, 1) = SC2_CLK function is selected.
 * |        |          |(1, 1, 0, 1) = AD14 function is selected.        
 * |[14]    |GPA_MFP14 |PA.14 Pin Function Selection
 * |        |          |Bits EBI_HB_EN[7] (ALT_MFP[23]), EBI_EN (ALT_MFP[11]), PA14_SC2RST (ALT_MFP1[13]) and GPA_MFP[14] determine the PA.14 function.
 * |        |          |(EBI_HB_EN , EBI_EN, PA14_SC2RST, GPA_MFP14) value and function mapping is as following list.
 * |        |          |(0, 0, 0, 0) = GPIO function is selected.
 * |        |          |(0, 0, 0, 1) = PWM2 function is selected.
 * |        |          |(0, 0, 1, 1) = SC2_RST function is selected.
 * |        |          |(1, 1, 0, 1) = AD15 function is selected.        
 * |[15]    |GPA_MFP15 |PA.15 Pin Function Selection     
 * |        |          |Bits PA15_SC2PWR (ALT_MFP1[12]), PA15_I2SMCLK (ALT_MFP[9]) and GPA_MFP[15] determine the PA.15 function.
 * |        |          |(PA15_SC2PWR, PA15_I2SMCLK, GPA_MFP15) value and function mapping is as following list.
 * |        |          |(0, 0, 0) = GPIO function is selected.
 * |        |          |(0, 0, 1) = PWM3 function is selected.
 * |        |          |(0, 1, 1) = I2S_MCLK function is selected.
 * |        |          |(1, 0, 1) = SC2_PWR function is selected.         
 * |[16:31] |GPA_TYPEn |Trigger Function Selection
 * |        |          |0 = GPIOA[15:0] I/O input Schmitt Trigger function Disabled.
 * |        |          |1 = GPIOA[15:0] I/O input Schmitt Trigger function Enabled.
 * @var GCR_T::GPB_MFP
 * Offset: 0x34  GPIOB Multiple Function and Input Type Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |GPB_MFP0  |PB.0 Pin Function Selection     
 * |        |          |Bit GPB_MFP[0] determines the PB.0 function.
 * |        |          |0 = GPIO function is selected to the pin PB.0.
 * |        |          |1 = UART0_RXD function is selected to the pin PB.0.       
 * |[1]     |GPB_MFP1  |PB.1 Pin Function Selection
 * |        |          |Bit GPB_MFP[1] determines the PB.1 function.
 * |        |          |0 = GPIO function is selected to the pin PB.1.
 * |        |          |1 = UART0_TXD function is selected to the pin PB.1.     
 * |[2]     |GPB_MFP2  |PB.2 Pin Function Selection
 * |        |          |Bits EBI_nWRL_EN (ALT_MFP[13]), EBI_EN (ALT_MFP[11]), PB2_T2EX (ALT_MFP[26]) and GPB_MFP[2] determine the PB.2 function.
 * |        |          |(EBI_nWRL_EN, EBI_EN, PB2_T2EX, GPB_MFP2) value and function mapping is as following list.
 * |        |          |(0, 0, 0, 0) = GPIO function is selected.
 * |        |          |(0, 0, 0, 1) = UART0_nRTS function is selected.
 * |        |          |(0, 0, 1, 1) = TM2_EXT function is selected.
 * |        |          |(1, 1, 0, 1) = nWRL(EBI) function is selected.     
 * |[3]     |GPB_MFP3  |PB.3 Pin Function Selection
 * |        |          |Bits EBI_nWRH_EN (ALT_MFP[14]), EBI_EN (ALT_MFP[11]), PB3_SC2CD (ALT_MFP1[14]), PB3_T3EX (ALT_MFP[27]) and GPB_MFP[3] determine the PB.3 function.
 * |        |          |(EBI_nWRH_EN, EBI_EN, PB3_SC2CD, PB3_T3EX, GPB_MFP3) value and function mapping is as following list.
 * |        |          |(0, 0, 0, 0, 0) = GPIO function is selected.
 * |        |          |(0, 0, 0, 0, 1) = UART0_nCTS function is selected.
 * |        |          |(0, 0, 0, 1, 1) = TM3_EXT function is selected.
 * |        |          |(0, 0, 1, 0, 1) = SC2_CD function is selected.
 * |        |          |(1, 1, 0, 0, 1) = nWRH(EBI) function is selected.              
 * |[4]     |GPB_MFP4  |PB.4 Pin Function Selection
 * |        |          |Bit GPB_MFP[4] determines the PB.4 function.
 * |        |          |0 = GPIO function is selected to the pin PB.4.
 * |        |          |1 = UART1_RXD function is selected to the pin PB.4.     
 * |[5]     |GPB_MFP5  |PB 5 Pin Function Selection
 * |        |          |Bit GPB_MFP[5] determines the PB.5 function.
 * |        |          |0 = GPIO function is selected to the pin PB.5.
 * |        |          |1 = UART1_TXD function is selected to the pin PB.5.     
 * |[6]     |GPB_MFP6  |PB.6 Pin Function Selection 
 * |        |          |Bit EBI_EN (ALT_MFP[11]) and GPB_MFP[6] determines the PB.6 function.
 * |        |          |(EBI_EN, GPB_MFP6) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = UART1_nRTS function is selected .
 * |        |          |(1, 1) = ALE(EBI) function is selected.
 * |[7]     |GPB_MFP7  |PB.7 Pin Function Selection
 * |        |          |Bit EBI_EN (ALT_MFP[11]) and GPB_MFP[7] determines the PB.7 function.
 * |        |          |(EBI_EN, GPB_MFP7) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = UART1_nCTS function is selected.
 * |        |          |(1, 1) = nCS(EBI) function is selected.         
 * |[8]     |GPB_MFP8  |PB.8 Pin Function Selection
 * |        |          |Bit GPB_MFP[8] determines the PB.8 function.
 * |        |          |0 = GPIO function is selected to the pin PB.8.
 * |        |          |1 = TM0 function is selected to the pin PB.8.        
 * |[9]     |GPB_MFP9  |PB.9 Pin Function Selection
 * |        |          |Bits PB9_S11 (ALT_MFP[1]) and GPB_MFP[9] determine the PB.9 function.
 * |        |          |(PB9_S11, GPB_MFP9) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = TM1 function is selected.
 * |        |          |(1, 1) = SPI1_SS1 function is selected.         
 * |[10]    |GPB_MFP10 |PB.10 Pin Function Selection
 * |        |          |Bits PB10_S01 (ALT_MFP[0]) and GPB_MFP[10] determine the PB.10 function.
 * |        |          |(PB10_S01, GPB_MFP10) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = TM2 function is selected.
 * |        |          |(1, 1) = SPI0_SS1 function is selected.     
 * |[11]    |GPB_MFP11 |PB.11 Pin Function Selection
 * |        |          |Bits PB11_PWM4 (ALT_MFP[4]) and GPB_MFP[11] determine the PB.11 function.
 * |        |          |(PB11_PWM4, GPB_MFP11) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = TM3 function is selected.     
 * |        |          |(1, 1) = PWM4 function is selected. 
 * |[12]    |GPB_MFP12 |PB.12 Pin Function Selection
 * |        |          |Bits EBI_EN (ALT_MFP[11]), PB12_CLKO (ALT_MFP[10]) and GPB_MFP[12] determine the PB.12 function.
 * |        |          |(EBI_EN, PB12_CLKO, GPB_MFP12) value and function mapping is as following list.
 * |        |          |(0, 0, 0) = GPIO function is selected.
 * |        |          |(0, 0, 1) = ACMP0_O function is selected.
 * |        |          |(0, 1, 1) = CLKO (Clock Driver output) function is selected.     
 * |        |          |(1, 0, 1) = AD0 function is selected.   
 * |[13]    |GPB_MFP13 |PB.13 Pin Function Selection
 * |        |          |Bit EBI_EN (ALT_MFP[11]) and GPB_MFP[13] determines the PB.13 function.
 * |        |          |(EBI_EN, GPB_MFP13) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = ACMP1_O function is selected.
 * |        |          |(1, 1) = AD1 function is selected.     
 * |[14]    |GPB_MFP14 |PB.14 Pin Function Selection
 * |        |          |Bits PB14_S31 (ALT_MFP[3]) and GPB_MFP[14] determine the PB.14 function.
 * |        |          |(PB14_S31, GPB_MFP14) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = INT0 function is selected.
 * |        |          |(1, 1) = SPI3_SS1 function is selected.
 * |[15]    |GPB_MFP15 |PB.15 Pin Function Selection
 * |        |          |Bits PB15_T0EX (ALT_MFP[24]) and GPB_MFP[15] determine the PB.15 function.
 * |        |          |(PB15_T0EX, GPB_MFP15) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = INT1 function is selected.
 * |        |          |(1, 1) = TM0_EXT function is selected.  
 * |[16:31] |GPB_TYPEn |Trigger Function Selection
 * |        |          |0 = GPIOB[15:0] I/O input Schmitt Trigger function Disabled.
 * |        |          |1 = GPIOB[15:0] I/O input Schmitt Trigger function Enabled.
 * @var GCR_T::GPC_MFP
 * Offset: 0x38  GPIOC Multiple Function and Input Type Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |GPC_MFP0  |PC.0 Pin Function Selection
 * |        |          |Bits PC0_I2SLRCLK (ALT_MFP[5]) and GPC_MFP[0] determine the PC.0 function.
 * |        |          |(PC0_I2SLRCLK, GPC_MFP0) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI0_SS0 function is selected.
 * |        |          |(1, 1) = I2S_LRCLK function is selected.          
 * |[1]     |GPC_MFP1  |PC.1 Pin Function Selection
 * |        |          |Bits PC1_I2SBCLK (ALT_MFP[6]) and GPC_MFP[1] determine the PC.1 function.
 * |        |          |(PC1_I2SBCLK, GPC_MFP1) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI0_CLK function is selected.
 * |        |          |(1, 1) = I2S_BCLK function is selected.     
 * |[2]     |GPC_MFP2  |PC.2 Pin Function Selection
 * |        |          |Bits PC2_I2SDI (ALT_MFP[7]) and GPC_MFP[2] determine the PC.2 function.
 * |        |          |(PC2_I2SDI, GPC_MFP2) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI0_MISO0 function is selected.
 * |        |          |(1, 1) = I2S_DI function is selected.
 * |[3]     |GPC_MFP3  |PC.3 Pin Function Selection
 * |        |          |Bits PC3_I2SDO (ALT_MFP[8]) and GPC_MFP[3] determine the PC.3 function.
 * |        |          |(PC3_I2SDO, GPC_MFP3) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = SPI0_MOSI0 function is selected.
 * |        |          |(1, 1) = I2S_DO function is selected.     
 * |[4]     |GPC_MFP4  |PC.4 Pin Function Selection
 * |        |          |Bit GPC_MFP[9] determines the PC.4 function.
 * |        |          |0 = GPIO function is selected to the pin PC.4.
 * |        |          |1 = SPI0_MISO1 function is selected to the pin PC.4.     
 * |[5]     |GPC_MFP5  |PC.5 Pin Function Selection
 * |        |          |Bit GPC_MFP[5] determines the PC.5 function.
 * |        |          |0 = GPIO function is selected to the pin PC.5.
 * |        |          |1 = SPI0_MOSI1 function is selected to the pin PC.5.     
 * |[6]     |GPC_MFP6  |PC.6 Pin Function Selection
 * |        |          |Bits EBI_EN (ALT_MFP[11]). PC6_SC0CD (ALT_MFP1[4]) and GPC_MFP[6] determine the PC.6 function.
 * |        |          |(EBI_EN, PC6_SC0CD, GPC_MFP6) value and function mapping is as following list.
 * |        |          |(0, 0, 0) = GPIO function is selected.
 * |        |          |(0, 0, 1) = ACMP0_P function is selected.
 * |        |          |(0, 1, 1) = SC0_CD function is selected.
 * |        |          |(1, 0, 1) = AD4 function is selected.     
 * |[7]     |GPC_MFP7  |PC.7 Pin Function Selection
 * |        |          |Bits EBI_EN (ALT_MFP[11]), PC7_SC1CD (ALT_MFP1[9]) and GPC_MFP[7] determine the PC.7 function.
 * |        |          |(EBI_EN, PC7_SC1CD, GPC_MFP7) value and function mapping is as following list.
 * |        |          |(0, 0, 0) = GPIO function is selected.
 * |        |          |(0, 0, 1) = ACMP0_N function is selected.
 * |        |          |(0, 1, 1) = SC1_CD function is selected.
 * |        |          |(1, 0, 1) = AD5 function is selected.      
 * |[8]     |GPC_MFP8  |PC.8 Pin Function Selection
 * |        |          |Bits EBI_MCLK_EN (ALT_MFP[12]), EBI_EN (ALT_MFP[11]), GPC_MFP[8] determine the PC.8 function.
 * |        |          |(EBI_MCLK_EN, EBI_EN, GPC_MFP8) value and function mapping is as following list.
 * |        |          |(0, 0, 0) = GPIO function is selected.
 * |        |          |(0, 0 ,1) = SPI1_SS0 function is selected.
 * |        |          |(1, 1, 1) = MCLK(EBI) function is selected.     
 * |[9]     |GPC_MFP9  |PC.9 Pin Function Selection
 * |        |          |Bit GPC_MFP[9] determines the PC.9 function.
 * |        |          |0 = GPIO function is selected to the pin PC.9.
 * |        |          |1 = SPI1_CLK function is selected to the pin PC.9.          
 * |[10]    |GPC_MFP10 |PC.10 Pin Function Selection
 * |        |          |Bit GPC_MFP[10] determines the PC.10 function.
 * |        |          |0 = GPIO function is selected to the pin PC.10.
 * |        |          |1 = SPI1_MISO0 function is selected to the pin PC.10.    
 * |[11]    |GPC_MFP11 |PC.11 Pin Function Selection
 * |        |          |Bit GPC_MFP[11] determines the PC.11 function.
 * |        |          |0 = GPIO function is selected to the pin PC.11.
 * |        |          |1 = SPI1_MOSI0 function is selected to the pin PC.11.        
 * |[12]    |GPC_MFP12 |PC.12 Pin Function Selection
 * |        |          |Bit GPC_MFP[12] determines the PC.12 function.
 * |        |          |0 = GPIO function is selected to the pin PC.12.
 * |        |          |1 = SPI1_MISO1 function is selected to the pin PC.12.      
 * |[13]    |GPC_MFP13 |PC.13 Pin Function Selection
 * |        |          |Bit GPC_MFP[13] determines the PC.13 function.
 * |        |          |0 = GPIO function is selected to the pin PC.13.
 * |        |          |1 = SPI1_MOSI1 function is selected to the pin PC.13.     
 * |[14]    |GPC_MFP14 |PC.14 Pin Function Selection
 * |        |          |Bits EBI_EN (ALT_MFP[11]) and GPC_MFP[14] determine the PC.14 function.
 * |        |          |(EBI_EN, GPC_MFP14) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = ACMP1_P function is selected.
 * |        |          |(1, 1) = AD2 function is selected.       
 * |[15]    |GPC_MFP15 |PC.15 Pin Function Selection
 * |        |          |Bits EBI_EN (ALT_MFP[11]) and GPC_MFP[15] determine the PC.15 function.
 * |        |          |(EBI_EN, GPC_MFP15) value and function mapping is as following list.
 * |        |          |(0, 0) = GPIO function is selected.
 * |        |          |(0, 1) = ACMP1_N function is selected.
 * |        |          |(1, 1) = AD3 function is selected.        
 * |[16:31] |GPC_TYPEn |Trigger Function Selection
 * |        |          |0 = GPIOC[15:0] I/O input Schmitt Trigger function Disabled.
 * |        |          |1 = GPIOC[15:0] I/O input Schmitt Trigger function Enabled.
 * @var GCR_T::GPD_MFP
 * Offset: 0x3C  GPIOD Multiple Function and Input Type Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |GPD_MFP0  |PD.0 Pin Function Selection
 * |        |          |Bit GPD_MFP[0] determines the PD.0 function.
 * |        |          |0 = GPIO function is selected to the pin PD.0.
 * |        |          |1 = SPI2_SS0 function is selected to the pin PD.0.     
 * |[1]     |GPD_MFP1  |PD.1 Pin Function Selection
 * |        |          |Bit GPD_MFP[1] determines the PD.1 function.
 * |        |          |0 = GPIO function is selected to the pin PD.1.
 * |        |          |1 = SPI2_CLK function is selected to the pin PD.1.
 * |[2]     |GPD_MFP2  |PD.2 Pin Function Selection
 * |        |          |Bit GPD_MFP[2] determines the PD.2 function.
 * |        |          |0 = GPIO function is selected to the pin PD.2.
 * |        |          |1 = SPI2_MISO0 function is selected to the pin PD.2.     
 * |[3]     |GPD_MFP3  |PD.3 Pin Function Selection
 * |        |          |Bit GPD_MFP[3] determines the PD.3 function.
 * |        |          |0 = GPIO function is selected to the pin PD.3.
 * |        |          |1 = SPI2_MOSI0 function is selected to the pin PD.3.     
 * |[4]     |GPD_MFP4  |PD.4 Pin Function Selection
 * |        |          |Bit GPD_MFP[4] determines the PD.4 function.
 * |        |          |0 = GPIO function is selected to the pin PD.4.
 * |        |          |1 = SPI2_MISO1 function is selected to the pin PD.4.     
 * |[5]     |GPD_MFP5  |PD.5 Pin Function Selection
 * |        |          |Bit GPD_MFP[9] determines the PD.5 function.
 * |        |          |0 = GPIO function is selected to the pin PD.5.
 * |        |          |1 = SPI2_MOSI1 function is selected to the pin PD.5.      
 * |[8]     |GPD_MFP8  |PD.8 Pin Function Selection
 * |        |          |Bit GPD_MFP[8] determines the PD.8 function.
 * |        |          |0 = GPIO function is selected to the pin PD.8.
 * |        |          |1 = SPI3_SS0 function is selected to the pin PD.8.     
 * |[9]     |GPD_MFP9  |PD.9 Pin Function Selection
 * |        |          |Bit GPD_MFP[9] determines the PD.9 function.
 * |        |          |0 = GPIO is function is selected to the pin PD.9.
 * |        |          |1 = SPI3_CLK function is selected to the pin PD.9.     
 * |[10]    |GPD_MFP10 |PD.10 Pin Function Selection
 * |        |          |Bit GPD_MFP[10] determines the PD.10 function.
 * |        |          |0 = GPIO function is selected to the pin PD.10.
 * |        |          |1 = SPI3_MISO0 function is selected to the pin PD.10.     
 * |[11]    |GPD_MFP11 |PD.11 Pin Function Selection
 * |        |          |Bit GPD_MFP[11] determines the PD.11 function.
 * |        |          |0 = GPIO function is selected to the pin PD.11.
 * |        |          |1 = SPI3_MOSI0 function is selected to the pin PD.11.     
 * |[12]    |GPD_MFP12 |PD.12 Pin Function Selection
 * |        |          |Bit GPD_MFP[12] determines the PD.12 function.
